<a href="https://colab.research.google.com/github/naomori/codexa_Pandas_Introduction/blob/master/Chapter7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# データセットのマージ

In [1]:
!wget https://www.codexa.net/wp-content/uploads/2017/12/002-4.csv
!wget https://www.codexa.net/wp-content/uploads/2017/12/002-5.csv

--2019-07-28 23:51:52--  https://www.codexa.net/wp-content/uploads/2017/12/002-4.csv
Resolving www.codexa.net (www.codexa.net)... 54.64.62.39, 13.115.61.79
Connecting to www.codexa.net (www.codexa.net)|54.64.62.39|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 88 [application/octet-stream]
Saving to: ‘002-4.csv’

002-4.csv           100%[===================>]      88  --.-KB/s    in 0s

2019-07-28 23:51:53 (8.57 MB/s) - ‘002-4.csv’ saved [88/88]

--2019-07-28 23:51:54--  https://www.codexa.net/wp-content/uploads/2017/12/002-5.csv
Resolving www.codexa.net (www.codexa.net)... 54.64.62.39, 13.115.61.79
Connecting to www.codexa.net (www.codexa.net)|54.64.62.39|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 77 [application/octet-stream]
Saving to: ‘002-5.csv’

002-5.csv           100%[===================>]      77  --.-KB/s    in 0s

2019-07-28 23:51:55 (11.4 MB/s) - ‘002-5.csv’ saved [77/77]

In [0]:
import pandas as pd

In [0]:
df4 = pd.read_csv('002-4.csv')
df5 = pd.read_csv('002-5.csv')

In [5]:
df4.head()

   user_id    Name  Age     Sex
0        1  Yamada   32    Male
1        2  Tanaka   45    Male
2        3   Murai   29  Female
3        4   Hoshi   38    Male

In [6]:
df5.head()

   user_id  class_id  status
0        1         3       0
1        1         2       1
2        2         1       1
3        2         6       0
4        2         3       0

In [7]:
print(df4.isnull().sum())
print(df4.shape)

user_id    0
Name       0
Age        0
Sex        0
dtype: int64
(4, 4)

In [8]:
print(df5.isnull().sum())
print(df5.shape)

user_id     0
class_id    0
status      0
dtype: int64
(9, 3)

In [20]:
print(df5.columns)
print(df5.index)

Index(['user_id', 'class_id', 'status'], dtype='object')
RangeIndex(start=0, stop=9, step=1)

In [0]:
user = df5.groupby('user_id')

In [25]:
user.describe()

        class_id                                 ... status
           count      mean       std  min   25%  ...    min   25%  50%   75%  max
user_id                                          ...
1            2.0  2.500000  0.707107  2.0  2.25  ...    0.0  0.25  0.5  0.75  1.0
2            3.0  3.333333  2.516611  1.0  2.00  ...    0.0  0.00  0.0  0.50  1.0
3            3.0  4.333333  3.511885  1.0  2.50  ...    0.0  0.50  1.0  1.00  1.0
4            1.0  9.000000       NaN  9.0  9.00  ...    1.0  1.00  1.0  1.00  1.0

[4 rows x 16 columns]

df4: ユーザ情報、df5: ユーザが受講するクラスの情報を、ユーザIDを軸にマージしてみる

In [0]:
df6 = pd.merge(df4, df5, on='user_id')

In [27]:
df6

   user_id    Name  Age     Sex  class_id  status
0        1  Yamada   32    Male         3       0
1        1  Yamada   32    Male         2       1
2        2  Tanaka   45    Male         1       1
3        2  Tanaka   45    Male         6       0
4        2  Tanaka   45    Male         3       0
5        3   Murai   29  Female         1       0
6        3   Murai   29  Female         4       1
7        3   Murai   29  Female         8       1
8        4   Hoshi   38    Male         9       1

## データの連結

In [0]:
data = [['5', '3', '0'], ['6', '5', '1'], ['7', '1', '1']]
columns=['user_id', 'class_id', 'status']
df6 = pd.DataFrame(data=data, columns=columns)

In [35]:
df6

  user_id class_id status
0       5        3      0
1       6        5      1
2       7        1      1

In [36]:
df5

   user_id  class_id  status
0        1         3       0
1        1         2       1
2        2         1       1
3        2         6       0
4        2         3       0
5        3         1       0
6        3         4       1
7        3         8       1
8        4         9       1

df5, df6 を連結させて df7 にする

In [0]:
df7 = pd.concat([df5, df6])

In [38]:
df7

  user_id class_id status
0       1        3      0
1       1        2      1
2       2        1      1
3       2        6      0
4       2        3      0
5       3        1      0
6       3        4      1
7       3        8      1
8       4        9      1
0       5        3      0
1       6        5      1
2       7        1      1

Index が 0-9, 0-2 と不連続なので、連続になるようにします。drop=True を指定しなければ、旧インデックスがデータ列に移動しますので、Trueにしておきます。

In [0]:
df7 = df7.reset_index(drop=True)

In [40]:
df7

   user_id class_id status
0        1        3      0
1        1        2      1
2        2        1      1
3        2        6      0
4        2        3      0
5        3        1      0
6        3        4      1
7        3        8      1
8        4        9      1
9        5        3      0
10       6        5      1
11       7        1      1